import React from "react";

const TermsAndConditions = () => {
  const termsText1 = `
  서비스 이용약관
  ​
  제 1장 총칙
  제 1조 (목적)
  이 약관은 Annode-kic(이하 “회사”라 합니다)가 제공하는 Pospace(이하 ‘서비스’라 합니다)를 회사와 이용계약을 체결한 ‘고객’이 이용함에 있어 필요한 팀과 고객의 권리 및 의무, 기타 제반 사항을 정함을 목적으로 합니다.
  ​
  제 2조 (약관 외 준칙)
  이 약관에 명시되지 않은 사항에 대해서는 위치 정보의 보호 및 이용 등에 관한 법률, 전기통신사업법, 정보통신망 이용 촉진및 보호 등에 관한 법률 등 관계법령 및 회사가 정한 서비스의 세부이용지침 등의 규정에 따릅니다. 
  ​
  제 2장 서비스의 이용
  제 3조 (가입자격)
  ① 서비스에 가입할 수 있는 자는 Application 이 설치가능한 모든 사람 입니다.
  ​
  제 4조 (서비스 가입)
  ① “Application 관리자”가 정한 본 약관에 고객이 동의하면 서비스 가입의 효력이 발생합니다.
  ②“Application 관리자”는 다음 각 호의 고객 가입신청에 대해서는 이를 승낙하지 아니할 수 있습니다. 
      1. 고객 등록 사항을 누락하거나 오기하여 신청하는 경우
      2. 공공질서 또는 미풍양속을 저해하거나 저해할 목적으로 신청한 경우
      3. 기타 회사가 정한 이용신청 요건이 충족되지 않았을 경우 
  ​
  제 5조 (서비스의 탈퇴)
  서비스 탈퇴를 희망하는 고객은 “Application 담당자”가 정한 소정의 절차(설정메뉴의 탈퇴)를 통해 서비스 해지를 신청할 수 있습니다.
   
  제 6조 (서비스의 수준)
  ① 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 단, 회사의 업무상이나 기술상의 이유로 서비스가 일시 중지될 수 있으며, 운영상의 목적으로 회사가 정한 기간에는 서비스가 일시 중지될 수 있습니다. 이러한 경우 회사는 사전 또는 사후에 이를 공지합니다. 
  ② 위치정보는 관련 기술의 발전에 따라 오차가 발생할 수 있습니다. 
  ​
  제 7조 (서비스 이용의 제한 및 정지)
  회사는 고객이 다음 각 호에 해당하는 경우 사전 통지 없이 고객의 서비스 이용을 제한 또는 정지하거나 직권 해지를 할 수 있습니다. 
      1. 타인의 서비스 이용을 방해하거나 타인의 개인정보를 도용한 경우
      2. 서비스를 이용하여 법령, 공공질서, 미풍양속 등에 반하는 행위를 한 경우
  ​
  제 8조 (서비스의 변경 및 중지)
  ① 회사는 다음 각 호의 1에 해당하는 경우 고객에게 서비스의 전부 또는 일부를 제한, 변경하거나 중지할 수 있습니다. 
      1. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
      2. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
      3. 서비스 제휴업체와의 계약 종료 등과 같은 회사의 제반 사정 또는 법률상의 장애 등으로 서비스를 유지할 수 없는 경우
      4.기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우 
  ② 제1항에 의한 서비스 중단의 경우에는 회사는 인터넷 등에 공지하거나 고객에게 통지합니다. 다만, 회사가 통제할 수 없는 사유로 인한 서비스의 중단 (운영자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 사후에 통지합니다. 
  ​
  제 5장 기타
  제 19조 (연락처) 010 8321 9409
  회사의 상호 다음과 같습니다.
  1. 상호: Annode-kic
  ​
  제 20조 (양도금지)
  고객 및 회사는 고객의 서비스 가입에 따른 본 약관상의 지위 또는 권리,의무의 전부 또는 일부를 제3자에게 양도, 위임하거나 담보제공 등의 목적으로 처분할 수 없습니다. 
  ​
  제 21조 (손해배상)
  ① 고객의 고의나 과실에 의해 이 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이 약관을 위반한 고객은 회사에 발생하는 모든 손해를 배상하여야 합니다.
  ② 고객이 서비스를 이용함에 있어 행한 불법행위나 고객의 고의나 과실에 의해 이 약관 위반행위로 인하여 회사가 당해 고객 이외의 제3자로부터 손해배상청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 고객은 그로 인하여 회사에 발생한 손해를 배상하여야 합니다. 
  ③ 회사가 위치정보의 보호 및 이용 등에 관한 법률 제 15조 내지 제26조의 규정을 위반한 행위 혹은 회사가 제공하는 서비스로 인하여 고객에게 손해가 발생한 경우, 회사가 고의 또는 과실 없음을 입증하지 아니하면, 고객의 손해에 대하여 책임을 부담합니다.
  ​
  제 22조 (면책사항)
  ① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
  ② 회사는 고객의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을 지지 않습니다.
  ③ 회사는 고객이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며, 그 밖에 서비스를 통하여 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다.
  ④ 회사에서 제공하는 서비스 및 서비스를 이용하여 얻은 정보에 대한 최종판단은 고객이 직접 하여야 하고, 그에 따른 책임은 전적으로 고객 자신에게 있으며, 회사는 그로 인하여 발생하는 손해에 대해서 책임을 부담하지 않습니다. 
  ⑤ 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우 회사는 인터넷 홈페이지 등에 이를 공지하거나 E-mail 등의 방법으로 고객에게 통지합니다. 단, 회사가 통제할 수 없는 사유로 인하여 사전 공지가 불가능한 경우에는 사후에 공지합니다. 
  ​
  제 23조 (분쟁의 해결 및 관할법원)
  ① 서비스 이용과 관련하여 회사와 고객 사이에 분쟁이 발생한 경우, 회사와 고객은 분쟁의 해결을 위해 성실히 협의합니다.
  ② 제1항의 협의에서도 분쟁이 해결되지 않을 경우 양 당사자는 정보통신망 이용촉진 및 정보보호 등에 관한 법률 제33조의 규정에 의한 개인정보분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.
    `;

  const termsText2 = `앱 실행에서 사용되는 권한
  모바일 앱 실행을 위해서 선택적으로 저장, 카메라, 파일 및 미디어, 마이크 권한이 필요합니다.
  
  [선택 허용 권한]
  
  저장 : 게시물 이미지 저장, 앱 속도 향상을 위한 캐시 저장
  카메라 : 게시물 이미지, 사용자 프로필 이미지 업로드를 위해서 카메라 기능 사용
  파일 및 미디어 : 게시물 파일 및 이미지 첨부를 위해서 파일 및 미디어에 접근기능을 사용
  마이크 : 사용자간의 음성 대화를 가능하게 하기 위해 마이크에 접근이 필요합니다.`;

  const termsText3 = `■ 개인정보 수집 항목​

  회사는 회원가입, 서비스 제공을 위해 아래와 같은 개인정보를 수집하고 있습니다.​
  
  *수집항목: 이메일, 비밀번호, 이름(닉네임), 프로필 사진, 전화번호, 계정생성일, 음성 데이터(사용자간의 음성 대화)
  
  *개인정보 수집방법: 앱 설치 후 회원가입 메뉴를 통해서 가입, 앱에서 사용자간의 음성 대화 기능 사용 시
  
  ■ 개인정보 수집 및 이용목적​
  
  회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.​
  
  회원 서비스에 이용에 따른 본인 확인 절차에 이용
  게시판 이용:회원가입을 한 사용자는 게시판 글 작성, 댓글 작성 좋아요 등 커뮤니티 활동을 이용할 수 있습니다.
  음성 서비스 제공: 사용자간의 음성 대화 기능 제공 및 이를 통한 커뮤니티 활동을 지원합니다.

  ■ 개인정보 수집에 대한 동의​
  
  회사는 회원님의 개인정보 수집에 대하여 동의를 받고 있으며,
  
  회원가입시 이용약관 및 개인정보취급방침에 개인정보 수집 동의절차를 마련해 두고 있습니다.
  
  회원님께서 ‘회원가입 및 이용약관에 동의하겠습니까’란에 체크하시면 개인정보 수집에 대해 동의한 것으로 봅니다.
  
  가입 후, 설정 메뉴에서도 이용약관 및 개인정보 취급방침 내용을 다시 확인할 수 있습니다. ​`;

  const termsText4 = `개인정보 제3자 제공​


  ■ 개인정보 제3자 제공​
  ​
  ※회사는 고객님의 동의없이 고객님의 정보를 제3자에게 제공하지 않습니다. ​
  ​
  개인정보를 ‘개인정보의 수집 및 활용 목적, 수집하는 개인정보 항목’에서 고지한 범위 내에서 활용합니다​
  ​
  수탁자에 공유되는 정보는 당해 목적을 달성하기 위하여 필요한 최소한의 정보에 국한됩니다. ​
  ​
  또한 고객의 서비스 요청에 따라 해당하는 업체에 선택적으로 개인 정보가 제공되고 있습니다.`;

  const termsText5 = `개인정보의 보유 및 이용 기간, 개인정보의 파기절차 및 파기방법​


  고객의 개인정보는 회원탈퇴 등 수집 및 이용목적이 달성되거나 동의철회 요청이 있는 경우 지체없이 파기됩니다.
  ■ 개인정보 보유 및 이용기간
  회사는 고객이 직접 회원탈퇴를 신청하기 전까지 개인정보를 보유 및 이용합니다.
  ​
  ■ 개인정보 파기절차 및 파기방법
  회사는 회원탈퇴를 신청한 고객의 개인정보를 예외 없이 파기합니다.
  파기절차 및 파기방법은 다음과 같습니다.
  ​
  개인정보의 보유 및 이용 기간, 개인정보의 파기절차 및 파기방법
  ​
  *파기절차
  회원님이 회원가입 등을 위해 입력하신 정보는 회원탈퇴를 신청한 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기되어집니다.
  별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.
  ​
  *파기방법
  종이에 출력된 개인정보는 분쇄기로 분쇄 또는 소각하여 파기합니다.
  전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.`;

  const termsText6 = `개인정보 취급 위탁 및 개인정보 제3자 제공​

  ■ 개인정보 취급 위탁 및 제3자 제공
  ​
  회사는 회원의 개인정보를 안전하게 보호하고, 개인정보의 수집 목적이나 이용 목적이 달성된 경우 해당 개인정보를 지체 없이 파기하는 것을 원칙으로 합니다. 이에 따라, 회사는 원칙적으로 회원의 개인정보를 외부에 제공하지 않습니다.
  ​
  단, 회원이 사전에 동의한 경우나 법령 등에 따라 특별한 규정이 있는 경우에만 개인정보를 제3자에게 제공하며, 이 경우 제공 받는 자, 제공 목적, 제공 정보의 내용, 정보를 제공 받는 자의 개인정보 보유 및 이용 기간 등을 사전에 명시하거나 통지합니다.
  ​
  ■ 개인정보 취급 위탁
  ​
  회사는 서비스 향상을 위해서 이용자의 개인정보를 보호할 수 있는 업무를 외부 전문 업체에 위탁하고 있지 않습니다. 앞으로 서비스 향상을 위해 개인정보 처리 업무를 외부에 위탁하는 경우에는 사전에 이용자에게 고지하겠습니다.
  ​
  위 내용은 회사가 개인정보를 취급하는 방식을 정확하게 반영하도록 설계되었습니다. 회사가 외부 업체에 개인정보 처리를 위탁하거나 개인정보를 제 3자에게 제공하는 경우에는 반드시 사전에 이용자에게 그 사실을 알리고 필요한 경우 동의를 받는 등 관련 법령을 준수하겠습니다.`;

  const termsText7 = `이용자 및 법정대리인의 권리와 그 행사방법​

  ■ 이용자 및 법정대리인의 권리와 그 행사방법​
  ​
  이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지 및 계정삭제를 요청할 수 있습니다.​
  이용자의 개인정보 조회, 수정을 위해서는 앱 내- 회원정보 수정 메뉴에서 정보 수정이 가능합니다.
  가입 해지는 앱 내 - 회원탈퇴’를 선택할 수 있습니다. ​
  개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 변경된 개인정보에 대하여 정정 및 철회의 조치를 하겠습니다.​
  ​
  귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. ​
  또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.​
  ​
  회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 회사가 수집하는 “개인정보의 보유 및 이용기간” 에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.​​
  `;

  const termsText8 = `개인정보 자동수집 장치의 설치·운영 및 거부에 관한 사항​

  ■ 개인정보 자동수집 장치의 설치·운영 및 거부에 관한 사항​
  ​
  회사는 서비스 제공을 위해 로그인 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다. 쿠키는 웹사이트를 운영하는데 이용되는 서버가 사용자의 브라우저에 보내는 작은 텍스트 파일로, 사용자의 장치에 저장됩니다. 이러한 쿠키를 통해 회사는 사용자의 로그인 정보를 기억하여 편의성을 높이고, 웹사이트 사용 패턴, 서비스 이용 통계 등을 파악함으로써 보다 더 향상된 서비스를 제공할 수 있습니다.
  ​
  쿠키의 사용 목적
  ​
  회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 로그인을 통한 식별에 사용됩니다.
  ​
  사용자는 쿠키 저장에 대한 선택권을 가지고 있습니다. 따라서, 사용자는 웹브라우저에서 옵션을
  설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나,
  아니면 모든 쿠키의 저장을 거부할 수 있습니다.
  ​
  쿠키 설정을 거부하는 방법으로는 사용자가 사용하는 웹 브라우저의 옵션을 선택하면 됩니다.`;

  const termsText9 = `개인정보 보호책임자​

  ■개인정보 보호책임자 ​
  회원님의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다. 개인정보와 관련하여 민원이나 문의가 있으시면, 연락주시기 바랍니다. 성심성의껏 응대하겠습니다.​
  ​
  *개인정보 책임자: 강익치
  *전화번호: 010-8321-9409
  *이메일: annodekic@gmail.com
  ​
  ​
  회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. ​
  회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.​
  ​
  기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.​
  ​
  1.개인분쟁조정위원회 (www.1336.or.kr/1336)​
  2.정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4)​
  3.대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr/02-3480-3600)​
  4.경찰청 사이버테러대응센터(www.ctrc.go.kr/)​`;

  const termsText10 = `개인정보 삭제 요청방법

  ■ 사용자 계정 삭제 요청 방법​
  사용자는 계정 삭제를 요청할 수 있습니다. ​
  *앱 실행 -로그인 후 '회원탈퇴'를 선택할 수 있습니다.​
  회원탈퇴시 계정이 삭제 처리되며, 사용자의 가입 정보 및 연관 정보가 모두 삭제 처리됩니다. ​
  ​
  ■ 사용자 데이터 일부 또는 전체 삭제 요청방법​
  사용자는 앱 내 – 설정- 회원정보 수정 메뉴를 통해 이메일 및 전화번호를 제외한 모든 입력가능한 사항을 직접 수정하거나 제거할 수 있습니다.​
  그 외 데이터 정보 삭제는 아래 방법으로 관리자에게 요청할 수 있습니다. ​
  사용자는 계정 삭제 외에 가입한 정보 일부 또는 전체 정보를 삭제하도록 관리자에게 요청할 수 있습니다. ​
  사용자 아이디, 이름을 기재하여 삭제가 필요한 정보를 메일로 보내주세요​
  -담당자 이메일: annodekic@gmail.com
  담당자가 확인하여 사용자가 요청하는 정보를 삭제할 수 있습니다. `;

  const termsText11 = `부칙​

  ■ 정책 변경에 따른 공지의무​
  이 개인정보보호방침은 2023년 4월 20일에 제정되었으며 법령·정책 또는 보안기술의 변경에 따라 내용의 추가·삭제 및 수정이 있을 시에는 변경되는 개인정보보호정책을 시행하기 최소 7일전에 고지하겠습니다.​
  `;

  return (
    <div>
      <br /> <br /> <h2>서비스 이용약관</h2>
      <textarea value={termsText1} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>앱 실행에서 사용되는 권한</h2>
      <textarea value={termsText2} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보의 항목 및 수집방법 및 수집하는 개인정보의 수집·이용 목적</h2>
      <textarea value={termsText3} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보 제3자 제공</h2>
      <textarea value={termsText4} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보의 보유 및 이용 기간, 개인정보의 파기절차 및 파기방법</h2>
      <textarea value={termsText5} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보 취급 위탁 및 개인정보 제3자 제공</h2>
      <textarea value={termsText6} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>이용자 및 법정대리인의 권리와 그 행사방법</h2>
      <textarea value={termsText7} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보 자동수집 장치의 설치·운영 및 거부에 관한 사항</h2>
      <textarea value={termsText8} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보 보호책임자</h2>
      <textarea value={termsText9} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>개인정보 삭제 요청방법</h2>
      <textarea value={termsText10} readOnly style={{ width: "100%", height: "400px" }} />
      <br /> <br /> <h2>부칙</h2>
      <textarea value={termsText11} readOnly style={{ width: "100%", height: "400px" }} />
    </div>
  );
};

export default TermsAndConditions;
